ConnectTest/src/Catalogs/matchingRequestsInformationSources/matchingRequestsInformationSources.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
	<name>matchingRequestsInformationSources</name>
	<hierarchical>true</hierarchical>
	<attributes>
		<name>Comment</name>
		<type>
			<types>String</types>
		</type>
	</attributes>
	<attributes>
		<name>compressAnswer</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>defaultResponse</name>
		<type>
			<types>String</types>
		</type>
	</attributes>
	<attributes>
		<name>mockServerMode</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>notSaveAnswer</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>performBackground</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>registrationDate</name>
		<type>
			<types>Date</types>
		</type>
	</attributes>
	<attributes>
		<name>staffOnly</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<tabularSections>
		<name>informationSources</name>
		<attributes>
			<name>Attribute</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>20</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>compressAnswer</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
		<attributes>
			<name>HTTPRequestType</name>
			<type>
				<types>EnumRef.HTTPRequestTypes</types>
			</type>
		</attributes>
		<attributes>
			<name>informationSource</name>
			<type>
				<types>CatalogRef.informationSources</types>
			</type>
		</attributes>
		<attributes>
			<name>mockServerMode</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
		<attributes>
			<name>notSaveAnswer</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
		<attributes>
			<name>notUse</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
		<attributes>
			<name>performBackground</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
		<attributes>
			<name>requestReceiver</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>50</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>requestSource</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>30</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>staffOnly</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Catalog>

ConnectTest/src/Catalogs/matchingRequestsInformationSources/ManagerModule.bsl
Function attributesStructure() Export

	attributesTable = DataLoad.getValueTable();
	attributesTableForNewItem = DataLoad.getValueTable();

	DataLoad.addRowInAttributesTable(attributesTable, "code", "code", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "parent", "parent", "ref");
	DataLoad.addRowInAttributesTable(attributesTable, "performBackground", "performBackground", "boolean");
	DataLoad.addRowInAttributesTable(attributesTable, "notSaveAnswer", "notSaveAnswer", "boolean");
	DataLoad.addRowInAttributesTable(attributesTable, "compressAnswer", "compressAnswer", "boolean");
	DataLoad.addRowInAttributesTable(attributesTable, "staffOnly", "staffOnly", "boolean");

	parentStruct = New Structure();
	parentStruct.Insert("matchingRequestsInformationSources", "uid");

	DataLoad.addRowInAttributesTable(attributesTable, "informationSources", "informationSources", "valueTable");

	attributesTableInformationSources = DataLoad.getValueTable();

	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "attribute", "attribute", "string");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "performBackground", "performBackground", "boolean");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "notSaveAnswer", "notSaveAnswer", "boolean");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "compressAnswer", "compressAnswer", "boolean");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "staffOnly", "staffOnly", "boolean");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "notUse", "notUse", "boolean");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "requestSource", "requestSource", "string");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "requestReceiver", "requestReceiver", "string");
	DataLoad.addRowInAttributesTable(attributesTableInformationSources, "informationSource", "informationSource", "ref");
	
	mdStruct = New Structure();
	mdStruct.Insert("informationSources", attributesTableInformationSources);
	mdStruct.Insert("informationSource", New Structure("informationSources", "uid"));
	mdStruct.Insert("parent", parentStruct);

	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", False, "matchingRequestsInformationSources", "catalog", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
